[
    {
        "id": 1,
        "companyName": "Fundit Inc",
        "jobTitle": "Full Stack Developer, Investor Web Platform",
        "startDate": "Oct 2023",
        "endDate": "Present",
        "location": "San Jose, CA",
        "responsibilities": [
            "Architected the Fundit website with authentication and data management using <mark>OAuth, Magic Link</mark> and <mark>MySQL</mark> and a robust backend <mark>REST API</mark> suite using <mark>Xano</mark>.",
            "Ensured a user-friendly and secure financial platform using <mark>Weweb, Javascript</mark> and <mark>CSS</mark>.",
            "Pioneered a conversational AI financial analyst enabling dynamic data extraction using <mark>Supabase (Postgres)</mark>, visualization using <mark>React.js, Next.js, Tailwind CSS</mark> and <mark>OpenAI LLMs</mark> with fine config control and customization."
        ],
        "collapsed": true
    },
    {
        "id": 2,
        "companyName": "Easley-Dunn Productions Inc",
        "jobTitle": "Lead Software Engineer",
        "startDate": "Jul 2023",
        "endDate": "Present",
        "location": "San Jose, CA",
        "responsibilities": [
            "Informed economy team strategies for the Robot Race game using <mark>C#, Unity Analytics, LiveOps (Remote Config)</mark> and <mark>Firebase Analytics</mark> and prompted tailored improvements with player behavior insights.",
            "Extracted data from events using <mark>BigQuery</mark> and <mark>SQL</mark> and constructed a dashboard for monitoring and analysis.",
            "Engineered the PluginImporter tool proactively using <mark>C#</mark> to automate management of Custom SDKs.",
            "Devised the ErrorLogger util to enable <mark>real-time crash reporting</mark> with custom error messages, eliminating debugging effort for <mark>500+ error logs</mark>."
        ],
        "collapsed": true
    },
    {
        "id": 3,
        "companyName": "DotSolved Systems Inc",
        "jobTitle": "Full Stack Developer Intern",
        "startDate": "Jul 2022",
        "endDate": "Aug 2022",
        "location": "Pleasanton, CA",
        "responsibilities": [
            "Developed a dynamic customer onboarding tool using Node.js and React, resulting in a <mark>30%</mark> increase in speed and <mark>$10,000-$20,000</mark> increase in revenue.",
            "Led end-to-end research and development efforts to convert proof-of-concepts to functional tools, enabling customization such as <mark>autosave, type selection, drag-and-drop</mark>, and <mark>multi-level reordering.</mark>"
        ],
        "collapsed": true
    },
    {
        "id": 4,
        "companyName": "AirAsia Technology Center",
        "jobTitle": "Software Engineer",
        "startDate": "Sep 2020",
        "endDate": "Jul 2021",
        "location": "Bangalore, India",
        "responsibilities": [
            "Accelerated hotel cancellation <mark>turnaround time by 90%</mark> using <mark>BigQuery</mark> and <mark>Google Cloud Functions</mark> in <mark>Java</mark>, serving <mark>800+ transactions per day</mark> and saving <mark>~$500 per transaction</mark>.",
            "Mitigated <mark>2 billable hours per transaction</mark> from the customer happiness team workload.",
            "Enhanced the booking interface for <mark>13 million MAUs</mark> using <mark>React.js, Redux</mark> and <mark>React Native</mark> to incorporate flexible hotel dates.",
            "Upgraded <mark>REST API</mark> suite using <mark>Java, Redis, Go</mark> and <mark>Typescript</mark> to accommodate flexible hotel bookings.",
            "Induced <mark>20% increase in conversion rate, 80% increase in engagement</mark> and <mark>revenue boost of ~$17,000 annually</mark>."
        ],
        "collapsed": true
    },
    {
        "id": 5,
        "companyName": "LogMeIn",
        "jobTitle": "Associate Software Engineering Intern",
        "startDate": "Jan 2020",
        "endDate": "Jul 2020",
        "location": "Bangalore, India",
        "responsibilities": [
            "Developed <mark>AWS Lambda</mark> functions with <mark>Python</mark> to monitor health events and send email alerts using <mark>SNS</mark>.",
            "Designed a web app using <mark>Angular, CSS</mark> and <mark>HTML</mark> to check the status of each network interface and redirect traffic during maintenance events.",
            "Trimmed maintenance effort from <mark>45 minutes to 2 minutes, alleviated downtime by 20%</mark> and <mark>reduced expenses of $2500 per event</mark>.",
            "Automated the employee onboarding process using <mark>Angular</mark> and <mark>Python, reducing team leads’ billable hours</mark> from <mark>48 hours to 30 minutes</mark>."
        ],
        "collapsed": true
    }
]
